In [26]:
import pandas as pd
df = pd.DataFrame({'a':[1,2,3],'b':[4,5,6],'c':[7,8,9]})
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [27]:
type(df)

pandas.core.frame.DataFrame

In [28]:
dummy = {'a':[1,2,3],'b':[4,5,6],'c':[7,8,9]}
df2 = pd.DataFrame(dummy)
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [29]:
a = [[1,4,7],[2,5,8],[3,6,9]]
df3 = pd.DataFrame(a)
df3

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [30]:
df3.columns = ['a','b','c']
df3

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [31]:
a = {'company' : ['abc','회사',123], '직원수' : [400, 10, 6]}
df4 = pd.DataFrame(a)
df4

  company  직원수
0     abc  400
1      회사   10
2     123    6

In [32]:
import numpy as np
a = {'company' : ['abc','회사',123], '직원수' : [400, 10, 6], '위치' :['seoul',np.NaN,'busan']}
df5 = pd.DataFrame(a)
df5

  company  직원수     위치
0     abc  400  seoul
1      회사   10    NaN
2     123    6  busan

In [33]:
#칼럼명 추출 / 변경
df=pd.DataFrame({'a':[1,2,3],'b':[4,5,6],'c':[7,8,9]})
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [34]:
df.columns[1]

'b'

In [35]:
df.columns = ['d','e','f']
df

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

In [36]:
df.columns = ['디','e','에프']
df

   디  e  에프
0  1  4   7
1  2  5   8
2  3  6   9

In [42]:
#rename을 통해 칼럼명 변경
df.rename(columns = {'d':'디','f':'에프'})
df

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

In [45]:
df.rename(columns = {'d':'디','f':'에프'}, inplace=True)
df

   디  e  에프
0  1  4   7
1  2  5   8
2  3  6   9